; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v6 ?v11)
             (pred_10 ?v4 ?v10)
             (pred_8 ?v6 ?v10)
             (pred_7 ?v8 ?v6 )
	     (pred_4 ?v6)
             (pred_9 ?v7)
             (pred_2 ?v4)
             (pred_12 ?v10)
             (pred_1 ?v6)
             (pred_3 ?v4)
             (pred_11 ?v6)
             (pred_5 ))



(:action op_5
:parameters (?v9 ?v5 ?v3 ?v13)
:precondition (and (pred_9 ?v9) (pred_9 ?v5) (pred_2 ?v3) (pred_12 ?v13)
          (pred_6 ?v9 ?v5) (pred_10 ?v3 ?v13)
                   (pred_8 ?v5 ?v13) (pred_4 ?v9) 
                   (pred_1 ?v5) (pred_3 ?v3))
:effect (and  (pred_11 ?v5) (not (pred_1 ?v5))))


(:action op_3
:parameters (?v9 ?v12)
:precondition (and (pred_9 ?v9) (pred_9 ?v12)
               (pred_4 ?v9) (pred_6 ?v9 ?v12) (pred_11 ?v12))
:effect (and (pred_4 ?v12) (not (pred_4 ?v9))))

(:action op_4
:parameters (?v9 ?v3)
:precondition (and (pred_9 ?v9) (pred_2 ?v3) 
                  (pred_4 ?v9) (pred_7 ?v3 ?v9) (pred_5 ))
:effect (and (pred_3 ?v3)
   (not (pred_7 ?v3 ?v9)) (not (pred_5 ))))


(:action op_1
:parameters (?v9 ?v2 ?v1)
:precondition (and (pred_9 ?v9) (pred_2 ?v2) (pred_2 ?v1)
                  (pred_4 ?v9) (pred_3 ?v1) (pred_7 ?v2 ?v9))
:effect (and (pred_3 ?v2) (pred_7 ?v1 ?v9)
        (not (pred_3 ?v1)) (not (pred_7 ?v2 ?v9))))

(:action op_2
:parameters (?v9 ?v3)
:precondition (and (pred_9 ?v9) (pred_2 ?v3) 
                  (pred_4 ?v9) (pred_3 ?v3))
:effect (and (pred_5 ) (pred_7 ?v3 ?v9) (not (pred_3 ?v3)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_02 obj_21 obj_14 obj_19 obj_15 obj_17 obj_13 obj_05 obj_01 obj_16 obj_11 obj_09 obj_10 obj_08 obj_20
    obj_12 obj_03 obj_04
    obj_22 obj_18 obj_07
    )

    (:init
       (pred_5)

       (pred_9 obj_06)
       (pred_9 obj_02)
       (pred_9 obj_21)
       (pred_9 obj_14)
       (pred_9 obj_19)
       (pred_9 obj_15)
       (pred_9 obj_17)
       (pred_9 obj_13)
       (pred_9 obj_05)
       (pred_9 obj_01)
       (pred_9 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_20)
       (pred_12 obj_12)
       (pred_12 obj_03)
       (pred_12 obj_04)
       (pred_2 obj_22)
       (pred_2 obj_18)
       (pred_2 obj_07)

       (pred_6 obj_06 obj_19)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_02 obj_15)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_21 obj_17)
       (pred_6 obj_21 obj_14)
       (pred_6 obj_21 obj_02)
       (pred_6 obj_14 obj_13)
       (pred_6 obj_14 obj_21)
       (pred_6 obj_19 obj_05)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_19 obj_06)
       (pred_6 obj_15 obj_01)
       (pred_6 obj_15 obj_17)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_17 obj_16)
       (pred_6 obj_17 obj_13)
       (pred_6 obj_17 obj_21)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_14)
       (pred_6 obj_13 obj_17)
       (pred_6 obj_05 obj_09)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_19)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_01 obj_15)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_16 obj_17)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_09 obj_05)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_08 obj_20)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_20 obj_08)
       (pred_1 obj_05)
       (pred_1 obj_01)
       (pred_1 obj_20)
       (pred_8  obj_05 obj_12)
       (pred_8  obj_01 obj_03)
       (pred_8  obj_20 obj_04)
       (pred_11 obj_06)
       (pred_11 obj_02)
       (pred_11 obj_21)
       (pred_11 obj_14)
       (pred_11 obj_19)
       (pred_11 obj_15)
       (pred_11 obj_17)
       (pred_11 obj_13)
       (pred_11 obj_16)
       (pred_11 obj_11)
       (pred_11 obj_09)
       (pred_11 obj_10)
       (pred_11 obj_08)

       (pred_10  obj_22 obj_12)
       (pred_10  obj_18 obj_03)
       (pred_10  obj_07 obj_04)
       (pred_7 obj_22 obj_13)
       (pred_7 obj_18 obj_06)
       (pred_7 obj_07 obj_06)
       (pred_4 obj_14)
    )

    (:goal (and
       (pred_7 obj_22 obj_08)
       (pred_7 obj_18 obj_17)
    ))
(:constraints
  (always (not (pred_4 obj_21)))
)
)

; plan
1. (op_3 obj_14 obj_13)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_13)
   goals met: 0 of 2
2. (op_3 obj_13 obj_17)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_17)
   goals met: 0 of 2
3. (op_3 obj_17 obj_15)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_15)
   goals met: 0 of 2
4. (op_3 obj_15 obj_19)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_19)
   goals met: 0 of 2
5. (op_3 obj_19 obj_06)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_06)
   goals met: 0 of 2
6. (op_4 obj_06 obj_18)
   deleted: (pred_7 obj_18 obj_06) (pred_5)
   added: (pred_3 obj_18)
   goals met: 0 of 2
7. (op_3 obj_06 obj_19)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_19)
   goals met: 0 of 2
8. (op_3 obj_19 obj_15)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_15)
   goals met: 0 of 2
9. (op_3 obj_15 obj_17)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_17)
   goals met: 0 of 2
10. (op_2 obj_17 obj_18)
   deleted: (pred_3 obj_18)
   added: (pred_5) (pred_7 obj_18 obj_17)
   goals met: 1 of 2
11. (op_3 obj_17 obj_13)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_13)
   goals met: 1 of 2
12. (op_4 obj_13 obj_22)
   deleted: (pred_7 obj_22 obj_13) (pred_5)
   added: (pred_3 obj_22)
   goals met: 1 of 2
13. (op_3 obj_13 obj_17)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_17)
   goals met: 1 of 2
14. (op_3 obj_17 obj_16)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_16)
   goals met: 1 of 2
15. (op_3 obj_16 obj_08)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_08)
   goals met: 1 of 2
16. (op_2 obj_08 obj_22)
   deleted: (pred_3 obj_22)
   added: (pred_5) (pred_7 obj_22 obj_08)
   goals met: 2 of 2
